<template>
<div class="container py-24">
    <div class="grid lg:grid-cols-3 md:grid-cols-2 sm:grid-cols-1 gap-5">
        <template v-for="resturant in establishedResturants" :key="resturant.img">
            <coreCard 
                :boxImage="`${resturant.img}`"
                :boxTitle="`${resturant.title}`"
                :boxDesc="`${resturant.desc}`" />
        </template>
    </div>
</div>
</template>

<script setup lang="ts">
import { ref } from 'vue'

const establishedResturants = ref([
    {
        img: 'resturant_1',
        title: 'اختيار الفكرة',
        desc: 'ندرس الفكرة المناسبة ونطورها بما يتناسب مع الشريحة المستهدفة واحتياجات سوق الضيافة'
    }, {
        img: 'resturant_2',
        title: 'دراسة السوق',
        desc: 'دراسة السوق للوصول الي التوقعات والتكلفة التي تمكنك من تحقيق الاهداف المطلوبة'
    }, {
        img: 'resturant_3',
        title: 'اختيار الموقع',
        desc: ' اختيار الموقع المناسب لمشروعك حسب النشاط والميزانية والشريحة المستهدفة للعمل عليها بشكل متقن'
    },{
        img: 'resturant_4',
        title: 'الهوية البصرية',
        desc: 'تصميم هوية احترافية من خلال فريق مختص في صميم هويات المطاعم والكوفي شوب'
    },{
        img: 'resturant_5',
        title: 'هندسة المنيو',
        desc: 'اختيار المنتجات بعناية للوصول الي اعلي معدل للطلب مع وضع استراتيجية للتسعير مقابل التكلفة'
    },{
        img: 'resturant_6',
        title: 'اعداد الوصفات',
        desc: 'وصفات مطورة تميز منتجاتك عن المنافسين مع مراعاة القيمة المضافة للمنتج وسهولة التحضير'
    },{
        img: 'resturant_7',
        title: 'جلسة التصوير',
        desc: 'جلسة تصوير احترافي للمنتجات والاطباق التي تقدمها لجذب المزيد من العملاء للتمتع بخدماته المتنوعة'
    },{
        img: 'resturant_8',
        title: 'تصميم المنيو',
        desc: 'تصميم منيو احترافي يسهل عملية الطلب ويعرض المنتجات علي الزبائن بشكل منسق وغير عشوائي'
    },{
        img: 'resturant_9',
        title: 'التوظيف والتدريب',
        desc: 'فريق المنيو سوف يساعدك في اختيار العمالة لمطعمك مع توفير البرامج التدريبية اللازمة لهم'
    },{
        img: 'resturant_10',
        title: 'تصميم المشروع',
        desc: 'تصميم داخلي احترافي ومناسب لفكرة النشاط والمنتجات التي ستقدمها للشريحة المستهدفة'
    },{
        img: 'resturant_11',
        title: 'تنفيذ المشروع',
        desc: 'نحن نقدر الوقت لذلك نعمل في اطار زمني حتي يتم تسليم المشروع بوقت قياسي وفق الميزانية المحددة'
    },{
        img: 'resturant_12',
        title: 'قائمة المعدات',
        desc: 'اختيار المعدات يتم بعناية حتي نساعدك في الحصول علي المعدات المناسبة بأفضلالأسعار'
    },{
        img: 'resturant_13',
        title: 'قائمة الموردين',
        desc: 'فريق المنيو سوف يساعدك في اختيار قائمة الموردين المناسبة لمطعمك والتفاوض معهم'
    },{
        img: 'resturant_14',
        title: 'التكاليف والأرباح',
        desc: 'اعداد ملفات التكلفة المباشرة والغير مباشرة لمطعمك حتي تتمكن من إدارة الأرباح بشكل صحيح'
    },{
        img: 'resturant_15',
        title: 'استراتيجية التسويق',
        desc: 'وضع استراتيجية للتسويق للوصول الي الشريحة المستهدفة، بالإضافة الي خطة العروض الترويجية'
    },{
        img: 'resturant_16',
        title: 'الافتتاح',
        desc: 'خطة الافتتاح التجريبي مع وضع اللمسات النهائية للافتتاح الرسمي لضمان الانطباع الأول عن المطعم'
    },{
        img: 'resturant_17',
        title: 'التغليف والتقديم',
        desc: 'فريق المنيو يساعدك في ابتكار أفكار جديدة للتغليف وطرق التقديم لتكون جزء من هوية المطعم'
    },{
        img: 'resturant_18',
        title: 'آليات التشغيل',
        desc: 'وضع اليات التشغيل لإدارة العمليات اليومية بشكل احترافي من التخزين حتي وصول المنتج للزبون'
    }
])
</script>